app/controllers/movies_controller.rb

SELECT "movies".* FROM "movies" ORDER BY release_date
---
  def index
    if params[:sort_by]
      @movies = Movie.order(params[:sort_by])